src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_ИсходныеДанныеСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ИсходныеДанныеСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстJson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВремениЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодМс</Name>
					<Comment>ТекущаяУниверсальнаяДата в мс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_ИсходныеДанныеСообщений/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(СсылкаНаОбъект, ТекстJson) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJson) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НЗ = РегистрыСведений.ксп_ИсходныеДанныеСообщений.СоздатьНаборЗаписей();
	НЗ.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НЗ.Отбор.ПериодМс.Установить(ПериодМс);
	стрк = НЗ.Добавить();
	стрк.СсылкаНаОбъект = СсылкаНаОбъект;
	стрк.ПериодМс = ПериодМс;
	стрк.ТекстJson = ТекстJson;
	стрк.МоментВремениЗаписи = ТекущаяДатаСеанса();
	НЗ.Записать();
		
КонецПроцедуры
